{"posts":[{"title":"Goodbye, WordPress","slug":"goodbye-wordpress","excerpt":"WordPress was potentially the most impactful and empowering technology I've yet encountered. It transformed my career path and enabled me to do anything I wanted at every point in my journey. So why leave it now?","coverImage":"gw.png","date":"2021-02-01","categories":["wordpress","javascript","vue"]},{"title":"Announcing Quina (My First App)!","slug":"announcing-quina-my-first-app","excerpt":"The story of building Quina, a word game Progressive Web App built with Nuxt, and launched on the Google Play Store.","coverImage":"social-share-image.png","date":"2020-12-10","categories":["javascript","design","web","vue"]},{"title":"How to Create Custom Editor Blocks with Block Lab","slug":"creating-custom-gutenberg-blocks-with-the-block-lab-plugin","excerpt":"Block Lab is a WordPress plugin that simplifies the process of creating custom blocks to use in the block editor, AKA Gutenberg, the new content editor in WordPress 5.0. This post explains how to use it, even if you only know basic HTML.","coverImage":"block-lab-banner.png","date":"2020-06-14","categories":["css","design","php","wordpress"]},{"title":"A New Headless Site with Gridsome","slug":"a-new-headless-site-with-gridsome","excerpt":"A lengthy write-up diving into what headless means, its advantages and disadvantages, some of the techniques and gotchas involved, and, finally, the new design of this site specifically.","coverImage":"wp-plus-gridsome.png","date":"2020-06-06","categories":["javascript","web","vue","wordpress"]},{"title":"This isn't the Time, But it's the Perfect Time; Goodbye, Instagram","slug":"goodbye-instagram","excerpt":"…Lately, I’ve been wondering whether I can actually continue supporting Instagram and the company behind it, however passively or at whatever seemingly insignificant scale. And while I was zeroing in on this answer anyway, the events of the last couple of weeks have clearly cemented in my mind that the answer—for me, at least—is an unequivocal “no.”","coverImage":"instagram-over-1.png","date":"2020-06-03","categories":["personal"]},{"title":"How to Connect Local with CodeKit","slug":"how-to-connect-local-with-codekit","excerpt":"Enjoy all the convenience of easy local WordPress development with Local, plus build tools with CodeKit, without any of the tricky command line setup.","coverImage":"Untitled.png","date":"2020-02-21","categories":["css","javascript","web","wordpress"]},{"title":"How to Check Uniqueness in an Array of Objects in JavaScript","slug":"confirm-all-ids-are-unique-in-an-array-of-javascript-objects-using-map-and-sets","excerpt":"Working with arrays of objects in JavaScript can be difficult. This post covers how to ensure all object keys (IDs) are unique, and how to find non-unique values.","coverImage":"EQ0-F2nXUAEpgCx.jpeg","date":"2020-02-17","categories":["javascript","web"]},{"title":"Adding Gutenberg Full- and Wide-Width Image Support to Your WordPress Theme","slug":"adding-gutenberg-full-and-wide-width-image-support-to-your-wordpress-theme","excerpt":"Gutenberg brings with it the ability to set image blocks as full-width or wide-width. This article talks about how to enable support for that feature in your theme, and one way to write the CSS that makes it work.","coverImage":"gutenberg-wide-illustration.png","date":"2019-03-16","categories":["css","web","wordpress"]},{"title":"Let's Learn CSS Variables!","slug":"lets-learn-css-variables","excerpt":"CSS variables (otherwise known as CSS custom properties) give previously impossible superpowers to CSS developers. This post covers what they are, how they work, and a couple of nifty ways you can implement them on your own website.","coverImage":"css-variables-1.png","date":"2018-02-25","categories":["css"]},{"title":"New Site, New Theme for 2018","slug":"new-site-new-theme-for-2018","excerpt":"Building a WordPress theme (and a new brand) from scratch.","coverImage":"2018-logo.jpg","date":"2018-01-02","categories":["design","web","php","wordpress"]},{"title":"Five Ways to Become a Better Designer (That Aren't Design)","slug":"five-ways-to-become-a-better-designer-that-arent-design","excerpt":"There’s vast world of design learning and opportunity right in front of us constantly. All we need to do is take the time to notice it and learn from it.","coverImage":"toa-heftiba-195458-1-1.jpg","date":"2017-02-04","categories":["design","thoughts-and-advice"]},{"title":"My Essential Tools for WordPress Development","slug":"essential-tools-wordpress-development","excerpt":"Some of these apps, resources and tools aren’t directly WordPress-related, or even necessarily development-related; some have to do with productivity or just make life a little easier. That’s by design. Part of being a developer is learning to work and use your tools as efficiently and with as little wasted time and mental energy as possible.","coverImage":"Screenshot-2016-06-24-20_45_21.png","date":"2016-06-25","categories":["thoughts-and-advice","web","wordpress"]},{"title":"The Five Things I Wish Somebody Had Told Me as a Design Student","slug":"the-five-things-i-wish-somebody-had-told-me-as-a-design-student","excerpt":"Your worst instructor as a design student will lay out clear goals and expectations which will not change; this is not a given with clients.","coverImage":"what-i-wish.png","date":"2016-02-21","categories":["design","personal","thoughts-and-advice"]},{"title":"WordPress Child Theme Explanation and Walkthrough","slug":"wordpress-child-theme-explanation","excerpt":"When you’re just starting out with WordPress, it’s easy to think that you can just open up the style.css file included with your theme and begin making alterations. And that will work—at least for a while—but it won’t be a good idea…","coverImage":"wordpress-bg-medblue.png","date":"2015-12-31","categories":["web","wordpress"]},{"title":"Why Designers Shouldn't \"Fix\" Other Designers' Logos","slug":"why-designers-shouldnt-remake-other-designers-logos","excerpt":"No matter how simple the end product, design is hard work. To come up with something that looks good, something people like, is at best tangential to the main point. The question is: does it succeed at meeting the project goals? And you don’t know how to answer that question.","coverImage":"Screen-Shot-2015-09-03-at-9_14_54-AM.png","date":"2015-09-04","categories":["design","personal","thoughts-and-advice"]},{"title":"8 Mistakes to Avoid in Your Student Design Portfolio","slug":"8-student-portfolio-mistakes","excerpt":"If your portfolio cost less than $20, is so large it can’t fit on a small table when open, is jammed full of huge illustrations and uses Helvetica all over the place, this is something you might want to read.","coverImage":"Negative-Space.png","date":"2015-08-20","categories":["design","thoughts-and-advice"]},{"title":"Profit is Not a Value","slug":"profit-is-not-a-value","excerpt":"Any executive or business owner will say their company values integrity, and virtually every company claims that they reward and value their employees exhibiting their brand values. But is that really accurate?","coverImage":"money.png","date":"2015-08-05","categories":["thoughts-and-advice","personal"]},{"title":"Understanding the Difference Between Image and Vector File Types","slug":"filetypes","excerpt":"If you’re like me, you’ve probably spent some time wondering (and Googling) about the differences between various popular format types commonly used for graphic design applications. So I decided I’d create a resource that’s hopefully a handy reference on the matter of discerning file type supports and behavior.","coverImage":"File-Types-Prev.png","date":"2015-06-11","categories":["design","web"]},{"title":"Pantone, Color, and What I Wish I Had Known Sooner as a Designer","slug":"pantone","excerpt":"One of the most difficult things for me to learn in my transition from the classroom to a professional branding agency was how to properly handle color output. So I decided to write this post in the hope of saving you some from some of the pitfalls that I failed to avoid.","coverImage":"ColorPost-4.jpg","date":"2015-04-01","categories":["design","thoughts-and-advice"]},{"title":"Social Media, Compulsion, and the 12 Things I Learned on My Break from Facebook","slug":"12-things","excerpt":"I’m beginning to believe that becoming more connected with everyone is making me less connected with anyone.","coverImage":"Untitled-21.png","date":"2015-03-27","categories":["personal"]}]}